In [8]:
import numpy as np
import pandas as pd

pd.set_option("display.max_rows", 101)
pd.set_option("display.max_columns", 15)

In [9]:
titanic_test = pd.read_csv("./titanic/train.csv")
titanic_test.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Data Dictionary

#### Variable	|     Definition	                                                              |                   Key

survival	    Survival	                                      0 = No, 1 = Yes
pclass	        Ticket class	                                  1 = 1st, 2 = 2nd, 3 = 3rd
sex	            Sex	
Age	            Age in years	
sibsp	        # of siblings / spouses aboard the Titanic	
parch	        # of parents / children aboard the Titanic	
ticket	        Ticket number	
fare	        Passenger fare	
cabin	        Cabin number	
embarked	    Port of Embarkation	                             C = Cherbourg, Q = Queenstown, S = Southampton

In [5]:
titanic_test.shape

(891, 12)

In [17]:
titanic_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
titanic_test.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [15]:
titanic_test.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [16]:
round(100 * titanic_test.isnull().sum()/len(titanic_test.index))

PassengerId     0.0
Survived        0.0
Pclass          0.0
Name            0.0
Sex             0.0
Age            20.0
SibSp           0.0
Parch           0.0
Ticket          0.0
Fare            0.0
Cabin          77.0
Embarked        0.0
dtype: float64

In [21]:
titanic_test = titanic_test.drop("Cabin", axis=1)

In [22]:
round(100 * titanic_test.isnull().sum()/len(titanic_test.index))

PassengerId     0.0
Survived        0.0
Pclass          0.0
Name            0.0
Sex             0.0
Age            20.0
SibSp           0.0
Parch           0.0
Ticket          0.0
Fare            0.0
Embarked        0.0
dtype: float64

In [24]:
titanic_test["Survived"].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [31]:
for col in titanic_test.columns:
    if col in ["PassengerId","Name", "Ticket", "Fare", "Age"]:
        continue
    print(col,":")
    print(titanic_test[col].value_counts())
    print("\n\n")

Survived :
0    549
1    342
Name: Survived, dtype: int64



Pclass :
3    491
1    216
2    184
Name: Pclass, dtype: int64



Sex :
male      577
female    314
Name: Sex, dtype: int64



SibSp :
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64



Parch :
0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64



Embarked :
S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [32]:
titanic_test.shape

(891, 11)

In [33]:
round(100 * titanic_test.isnull().sum()/len(titanic_test.index))

PassengerId     0.0
Survived        0.0
Pclass          0.0
Name            0.0
Sex             0.0
Age            20.0
SibSp           0.0
Parch           0.0
Ticket          0.0
Fare            0.0
Embarked        0.0
dtype: float64

In [39]:
titanic_test = titanic_test[~titanic_test["Age"].isnull()]

In [40]:
titanic_test.shape

(714, 11)

In [41]:
round(100 * titanic_test.isnull().sum()/len(titanic_test.index))

PassengerId    0.0
Survived       0.0
Pclass         0.0
Name           0.0
Sex            0.0
Age            0.0
SibSp          0.0
Parch          0.0
Ticket         0.0
Fare           0.0
Embarked       0.0
dtype: float64